node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 5
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_5"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_6"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_7"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_8"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_9"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_10"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_11"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_12"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_13"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_14"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_15"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_16"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_17"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_18"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_19"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_20"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_21"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_22"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_23"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_24"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Placeholder_25"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_26"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_27"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_28"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_29"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_30"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_31"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_32"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_33"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "actor_agent/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\005\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5345224738121033
      }
    }
  }
}
node {
  name: "actor_agent/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5345224738121033
      }
    }
  }
}
node {
  name: "actor_agent/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 37
    }
  }
}
node {
  name: "actor_agent/random_uniform/sub"
  op: "Sub"
  input: "actor_agent/random_uniform/max"
  input: "actor_agent/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent/random_uniform/mul"
  op: "Mul"
  input: "actor_agent/random_uniform/RandomUniform"
  input: "actor_agent/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent/random_uniform"
  op: "Add"
  input: "actor_agent/random_uniform/mul"
  input: "actor_agent/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 16
          }
        }
        tensor_content: "\212\311\276\276\014VZ>}c\344\276N\3002\276\334\013\370\275\240A\220<\33097>\266\224\344>\262qm\276\216\006V\276\372j\363>\264\221\036>\274\227\322\275n\223\231>\224\321\343\276F\010\215>\3743\244\276H\'\010>\316\311\231\276\260\311O\275\366@\366>\251\204\200\276\360\350G=\262\203;\276p\341\017=\203C\313\276\337\362\357\276\224\332\212\276@\255\352>(\342\360\276V]\312>\026v\361>\264\014\033\276\326\221\002\277\302]\243>;\351\005?\340\235\363=\254l\251>\3766\275>\246\204O\276\340\361V=@\216E>\220\035\362=v^\004\277\274m\254\276p\225i=:\344\260\276\300\177\014>\260\336\333>@\240\226\276\224\300d\276P\203O\276\220\034G\276\232a\323\276v]\236\276\250\254\316>\200h\244\275\010BA\276 u\333\275D\255X>\304\325A>\276\250\230>\026\361\003\277\316\331\244\276\342\005\005\277v\230\261>\346;0\2760/\024>\270\356\357\275\030\205N\275\230\372\315\276\206|\020\276P\236\305>|\342\264>\353_\224\276J\035f\276f\347\361>\300\033 >\257i\004?x\331\314="
      }
    }
  }
}
node {
  name: "actor_agent/Variable/Assign"
  op: "Identity"
  input: "actor_agent/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent/Variable"
      }
    }
  }
}
node {
  name: "actor_agent/Variable/read"
  op: "Identity"
  input: "actor_agent/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_1/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_1/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_1/Variable/Assign"
  op: "Identity"
  input: "actor_agent_1/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_1/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_1/Variable/read"
  op: "Identity"
  input: "actor_agent_1/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_1/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5
      }
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_2/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 51
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_2/random_uniform/max"
  input: "actor_agent_2/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_2/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_2/random_uniform/RandomUniform"
  input: "actor_agent_2/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_2/random_uniform"
  op: "Add"
  input: "actor_agent_2/random_uniform/mul"
  input: "actor_agent_2/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_2/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
          dim {
            size: 8
          }
        }
        tensor_content: "p\312\261\275`\274\036>\004\356\202\276|x\356\276\320\357\373>86b>@/\005\275L\313\221>d\200\366>t\260\315><q\221\2760l\354>\000\263\357\273\000\0043>\2445\232\276\344\347\306>\360\351\253\276PP\304\276\200U\242>\240>\261\276`\246\n>\344\351\210>\220\353L\276\030\222\037\276\000o\010=`\376\343\276\024\305\370>\300=\226<@4>\276\320\2550\276P\207\253\276\014\365\204\276\260\223\365>\000X<\276\340=\370\275\210\344(\276\200\251\373\274\000t\246\2750\376\t>\034\001\345\276\250\005\304\276\204\343\365\276TV\224>\024\026\261>d\311\271\276\300\230\336<\0001\236;\200\272x\276\340\313\"\276(\225\226>\000\200\372\271\334\215\327>\254\337\212\276\020\247\223=\014\n\231>\200\215O=pyz\276\220\177\355=L\007\233>hm\335>\210\233\343>\020\270\333>\250\254\307>\310N\031>\220w\343=8\221\004\276\030\200\r\276\034\220\265>\000\037\277;h<l>\260i\322=0\335\222\276\350\366&>\354y\207>\0144\360>\360\251\330\275\300\005T\276\330\350\271\276\210\352J\276\350\305\242\276\200\200O<\240\r\177\275@\241D=\240\037P\276\220\304\270>,/\213>P~\331=\310\020\361> \373|>x)\002>${\225>\034q\353\276 \327x\275\364\303\347\276 9 >@\261k>4\037\342\276\260T\004\276@\036:=@\361n\276HFU\276\350\245\007\276\350q\021>\324\034\301\276\220\205\252\275\224/\331>@\332\370\275 -`\275 \002\315>0\034\362\275\310\217\261\276T\200\303>\354u\327\276\2509`>(\261m>\230d$>p\n\376=\350;\313>Ds\373>`)k=P\'\235\275H\004\320>(\214\360\276\200\304\375<d\t\277>\350k\317\276D\230\223>$?\325>"
      }
    }
  }
}
node {
  name: "actor_agent_2/Variable/Assign"
  op: "Identity"
  input: "actor_agent_2/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_2/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_2/Variable/read"
  op: "Identity"
  input: "actor_agent_2/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_2/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_3/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_3/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_3/Variable/Assign"
  op: "Identity"
  input: "actor_agent_3/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_3/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_3/Variable/read"
  op: "Identity"
  input: "actor_agent_3/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_3/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.6123724579811096
      }
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.6123724579811096
      }
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_4/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 65
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_4/random_uniform/max"
  input: "actor_agent_4/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_4/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_4/random_uniform/RandomUniform"
  input: "actor_agent_4/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_4/random_uniform"
  op: "Add"
  input: "actor_agent_4/random_uniform/mul"
  input: "actor_agent_4/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_4/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 8
          }
        }
        tensor_content: "\255\302\023?\220\357Q>^\r\211>~\274[\276\323\333\370\276\021,\375\276\210\r\302\276\010,\325=\344\226\331\276>+\367\276\220\361\261\276EY\270\276u\342\006\277\332\024f\276f\215>\276\312\270\215\276\016\345\336>P\000\017\276\216\007\241>\320\333\276=VP\323>>\343\366>\3767\016\277?\373\022\277g\235\005?1i\033?\000\215\003\276(ci>\240b\236\275l\026\006\276@\177\006\274\177\302\034?`\342[=\n\\G\276\377\034\033?\000\220\003=\024\020n>~\340\325>\332\251\266>L\214\316\276\250Q\306\276N\006\031\276\204\243\231>\240jD>\244d\226\276p\277\245>\230\361\256\276\204\020\030>\200Hf\274\340(\351=\026\216\266\276\310\366\265=hvy>\200\020A>\017\203\031\2770\010\n>\335\002\033?\010\237\236=\351O\033\277\251\356\005?\227D\005\277\367\263\201\276\244\263\213\276\353\336\033?"
      }
    }
  }
}
node {
  name: "actor_agent_4/Variable/Assign"
  op: "Identity"
  input: "actor_agent_4/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_4/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_4/Variable/read"
  op: "Identity"
  input: "actor_agent_4/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_4/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_5/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_5/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_5/Variable/Assign"
  op: "Identity"
  input: "actor_agent_5/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_5/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_5/Variable/read"
  op: "Identity"
  input: "actor_agent_5/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_5/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5
      }
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_6/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 79
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_6/random_uniform/max"
  input: "actor_agent_6/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_6/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_6/random_uniform/RandomUniform"
  input: "actor_agent_6/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_6/random_uniform"
  op: "Add"
  input: "actor_agent_6/random_uniform/mul"
  input: "actor_agent_6/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_6/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 16
          }
        }
        tensor_content: "\200\316p<\260u\377\275\224\216\304>\000\356\277<D\322\317>(\231\245\276(\335H>\230\273;>4j\224\276`\3242>\330\354\026\276xOH\276\024<\377\276\300\223\236=\200\356m\276\330\336\375>\2600\327\275 \375\204=\204o\373\276\270&c>\350d\226> \244\255>@\200\264=\304\216\230>\314G\232>\304$\357>\004\306\302>\354\227\220\276\030\273z>\300\277\213\275\030A\345\276Pi^>\234\264\202\276\230.\275\276\354\025\240>\344\301\306\276\200\301\236=0o6\2768\231y>\200\376\005\275\270d*\276\340\\\334\275\204M\210\276p\025\253\276`\303\233\276\200z\227\275\330\231\310\276\240 \r\276T]\332>\260h\210\275 \234\366=X\247?\276\204J\236>\330`\376>\230\033\025>\360)\322=\320\210\234=x\200J>pY\t>@r\362<\264\321\251\276(g\025\276\240\013\273>\2005!\275\240\032\224=\200\247g\276`\342\277=8\020B>8\257\017>0\204\016>\200|\014>|\263\347>\320\201b\276\354\254\335>\210\355\\>\350\031\240>H\006\\>\230m\224>\274\347\266>h)E\276\300\017\364\275\210\3720\276@=\342<\260w\242>\224\221\265\276\300\262\202\276\3204,>(+%>Xi\371>\204\007\270>\210n\270\2760\351\265=\030]w\276$e\272\276ph\372=\000\230/;\320G{\276<\007\304\276p;\304\275@\305\027=\370\2346><\214\212\276\350\2100\276X\346%\276\300\337\255=\320\261\272> U\306=@\274U>\370\247\201\276\200\014\216\274\300`\305=<\261\267>\314z\252\276\000&T\273\240\374\005>\010\204\327\276\224\246\342\276\240D\246\276\350u\324>\300\223\321=\350\014E>\224e\364\276\020\000`\276\014\006\377\276\360\307\213\276\300j\312<\300\225\305<\340k)>"
      }
    }
  }
}
node {
  name: "actor_agent_6/Variable/Assign"
  op: "Identity"
  input: "actor_agent_6/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_6/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_6/Variable/read"
  op: "Identity"
  input: "actor_agent_6/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_6/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_7/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_7/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_7/Variable/Assign"
  op: "Identity"
  input: "actor_agent_7/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_7/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_7/Variable/read"
  op: "Identity"
  input: "actor_agent_7/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_7/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5
      }
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_8/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 93
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_8/random_uniform/max"
  input: "actor_agent_8/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_8/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_8/random_uniform/RandomUniform"
  input: "actor_agent_8/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_8/random_uniform"
  op: "Add"
  input: "actor_agent_8/random_uniform/mul"
  input: "actor_agent_8/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_8/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
          dim {
            size: 8
          }
        }
        tensor_content: "\360R\277>T\254\334>\360\233\367>\330\026\340>d\242\236\276\030\033\216>\264m\226\276\244\306\366\276\340X7\276\214\330\363\276\2244\341>,,\244\276x\360\304\276\020\254s\276\320\n$\276\230BN\276\264\317\212\276lH\377>H\325\316>\250\373x>\000\2554\274\344\013\302>l\212\277>0S\343=\260/\264\276\004\227\207\276p\265H\276PP\303>\010\307\236>@?\220<\240\370\316=Ph\334\276\264\324\206\276p\211\235\275\270h\361>\360\273\305=\334\341\353\276\220\225\301\275\014\013\370\276\\\351\200>x[$\276P;\010\276\000O\350\276p\311\022>p\t\033>\000\205\027=\310=\317\276(T\374\276\200\244\000\275\034f\275\276\004\247\333>P\003L\276\224\241\247>\204i\313\276\274\313\376\276 6@>\000\240\231<l\276\337\276\224\025\307\276\360\360\323\275\364\025\336\276\200\213\335\276\254w\235>\374\241\226>\364T\322\276@\265Q\275P\366\302\276\314\374\335\2768\017\003>pJ\243\276\020*\301>\270\326\242\276\3501\356\276\200$\320=\200\313u=\000\325g\274\260\236\234\276`v\177=@*\372=`\330\215=\240\322\003> \226\244=hUe>\260d\240\276\244\035\334>\200\343y=\200{\375=\304\313\357\276L8\340>\310\000\211>\214\037\361>T^\357>\200\2722=@[\330\275@[\205\276\210\360\212\276 J4>H\340\240>P\374\242\276\200(\375<\214a\224\276(6A\2764\315\235>p\313\213\275<\214\326>\240a\371\2750I\265\275\360\260\314>p^\020>\364\225\251><\375\341>0n\021>h\224\217>\310\0104>H\347\241>\020<\340>\0007(\274\300d\341\275\310\006\037>\330:c\276\224\033\240>\260\211\336>\000\3638\276\024!\352\276D\345\305\276T\351\236>@\250\272\275\200\007m<"
      }
    }
  }
}
node {
  name: "actor_agent_8/Variable/Assign"
  op: "Identity"
  input: "actor_agent_8/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_8/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_8/Variable/read"
  op: "Identity"
  input: "actor_agent_8/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_8/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_9/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_9/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_9/Variable/Assign"
  op: "Identity"
  input: "actor_agent_9/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_9/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_9/Variable/read"
  op: "Identity"
  input: "actor_agent_9/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_9/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.6123724579811096
      }
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.6123724579811096
      }
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_10/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 107
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_10/random_uniform/max"
  input: "actor_agent_10/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_10/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_10/random_uniform/RandomUniform"
  input: "actor_agent_10/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_10/random_uniform"
  op: "Add"
  input: "actor_agent_10/random_uniform/mul"
  input: "actor_agent_10/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_10/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 8
          }
        }
        tensor_content: "\272\376\335>\000\250h>_\273\013?.\273\242\276\010\213i>88f>\360O\224>!\203\004?rZ\332>\002\373\223\276\200\241\247\274\322\202\326>\363#\003?;\376\017\277\034B\204>\300\325\343\274@\327\027\277\006\n\241\276\340p\347\276H\202T>\370\346\224=\270u\321\275\222U\002\276\351\331\000?\360\267?>\322\262\315>\272,\234>J\221\337\276\2400R>\030\374\342=8\001\275\275\032@\000\277P\271P=TQO\276\242\023\216>\236\200\335>/\016\316\276\366\001\310>\340\330\034>\376|\344\276 \353O\275\2465\221\276\373\327\013?h\234F\276\003y\000?X{\250\276<\307\201\276\370<)>\312u\263>0Wr>0\365\025=H\266,>\266\341\350>FX\314>f\r\004\277p\263\241>\264\365C>F+?\276\362\260\022\277\006:\030\277&X\203\276i\346\031?.\210T\276\216!\250\276"
      }
    }
  }
}
node {
  name: "actor_agent_10/Variable/Assign"
  op: "Identity"
  input: "actor_agent_10/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_10/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_10/Variable/read"
  op: "Identity"
  input: "actor_agent_10/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_10/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_11/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_11/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_11/Variable/Assign"
  op: "Identity"
  input: "actor_agent_11/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_11/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_11/Variable/read"
  op: "Identity"
  input: "actor_agent_11/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_11/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5
      }
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_12/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 121
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_12/random_uniform/max"
  input: "actor_agent_12/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_12/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_12/random_uniform/RandomUniform"
  input: "actor_agent_12/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_12/random_uniform"
  op: "Add"
  input: "actor_agent_12/random_uniform/mul"
  input: "actor_agent_12/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_12/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 16
          }
        }
        tensor_content: "\010\217`>H\025Z>p\234\t\276\354\304\274\276\200\027\241\274t\264\266\276@\311\373<h#H>\200=\345\276(\364k\276\274f\224\276\230P\311>`\303_\276\34043\275\324\230\230>\230=3\2768y\004>`\270\">8\255e\276\200n\231\274\034\256\236>\300\332z\276\224\350\333\276\240\3237=H\344\342>@\262\310<\254\230\332>XN`\276\000\361\205\274\324\345\301>\200\264^<\210;\025>@\236\007\275\330Z\225>`\000\267=\3708m\276\000\334\202;\\\000\245>\240\202F\275\000\304\256\272\234\270\266\276\240b\213\275\000\020\330\271x\215?>\300]\"\276,g\261>\3648\345>`\226h>\300\220k>P\264\220\276@\206C=\200\345\224=h\277l\276\000\312\\\273\270\'\375>H&8>\020\272\247=\320\321\354\275\320R:\276\220\3414\276\374/\315>l\227\206>\230\234]\276\000W\315<X\255x>\220]\033>@/r\276(\370\324>\270\247\021>\344F\214\276\240\235a\276x\240\007\276\220\000\311\276(r\225\276\320n\235=L\322\271\276\310\200\271\276t\000\361\276\300\341/\275`,\237\276X\373\263\276(\0278>h:\360> \224:=\000W\331\276\020u\241\2764\201\314>\374\214\242>\340r\333\276@Z\234=x\367\246>\000\317\272>\220\331\332\275`$#>\360d\202>`#\341\276\360\320g>\374z\200>\320k\013>\374/\307>\260qd\276h\300\321\276\240\210K=4\232\352>\260\307\026><\250\234\276\230\337 \2768lc>\004|\251>@\032?\276\320M\240=\2302L\276X\311>>\000\210&\275\244\\\257\276\230\021\">\304\'\337\276\010\3528>D\224\373\276p\315\201\276\300e;=h\220\">h\341\256>\260\302\224>\360\337\003>\200\356\232\274\344\224\262\276\350qu\276"
      }
    }
  }
}
node {
  name: "actor_agent_12/Variable/Assign"
  op: "Identity"
  input: "actor_agent_12/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_12/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_12/Variable/read"
  op: "Identity"
  input: "actor_agent_12/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_12/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_13/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "actor_agent_13/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_13/Variable/Assign"
  op: "Identity"
  input: "actor_agent_13/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_13/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_13/Variable/read"
  op: "Identity"
  input: "actor_agent_13/Variable"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@actor_agent_13/Variable"
      }
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.5
      }
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "actor_agent_14/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 135
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/sub"
  op: "Sub"
  input: "actor_agent_14/random_uniform/max"
  input: "actor_agent_14/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_14/random_uniform/mul"
  op: "Mul"
  input: "actor_agent_14/random_uniform/RandomUniform"
  input: "actor_agent_14/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_14/random_uniform"
  op: "Add"
  input: "actor_agent_14/random_uniform/mul"
  input: "actor_agent_14/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "actor_agent_14/Variable"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
          dim {
            size: 8
          }
        }
